// Привет! Я - число, растущее само по себе!
console.log( 9999999999999999999 ); 

/* Причина та же - потеря точности. Из 64 бит,,
отведённых на число, сами цифры числа занимают до
52 бит, остальные 11 бит хранят позицию десятичной 
точки и один бит - знак. Так что если 52 бит не хватает
на цифры, то при записи пропадут младшие разряды. */

/* Интерпретатор не выдаст ошибку, но в результате
получится "не совсем то число", что мы и видим в 
примере выше. Как говорится: "как смог, так записал". */