/* Чтобы клонировать объекты, нам нужно создать новый объект и 
воспроизвести структуру существуюшего, перебрав его свойства
и скопировав их на примитивном уровне. Например: */

let user = {
    name: "John",
    age: 30,
};

let clone = {}; // новый пустой объект

// давайте скопируем все свойства user в него
for (let key in user) {
    clone[key] = user[key];
};

// теперь clone это полностью независимый объект с тем же содержимым
clone.name = "Pete"; // изменим в нём данные

console.log(user);
console.log(clone);