/* В реальном коде часто нам необходимо использовать существующие 
переменные как значения для свойств с тем же именем. Например: */

function makeUser(name,age) {
    return {
        name: name,
        age, age, 
        // ... другие свойства
    };
};

let user1 = makeUser("John",30);
let user2 = makeUser("Sasha", 27);

console.log(user1,user2); 

/* Вывод: результаты работы функции makeUser присваиваются 
переменным user1 и user2. При этом сама функция makeUser 
возвращает объект используя оператор return. В объекте, который
возвращает функция makeUser есть два свойства, значения которых
функция получает из параметров, которых тоже всего два. */