/* Технически также возможно получить доступ к объекту
без ключевого слова this, обратившись к нему через
внешнюю переменную (в которой хранится ссылка на этот
объект): */

let user = {
    name: "Sasha",
    age: 27,
    sayHi() {
        console.log(user.name);
        console.log(user.age);
    },
};

user.sayHi();

/* Но такой метод ненадёжен. Если мы решим
скопировать ссылку на объект user в другую
переменную, например, admin = user, и
перезапишем переменную user чем-то другим, тогда
будет осуществлён доступ к неправильному объекту при
вызове метода из admin. */

let user2 = {
    name: "Vlad",
    age: 26,
    sayHi() {
        console.log(this.name);
        console.log(this.age);
    },
};

user2.sayHi();