/* Стрелочные функции особенные: у них нет своего
"собственного" this. Если мы ссылаемся на this внутри
такой функции, то оно берётся из внешней "нормальной"
функции. Например, здесь arrow() использует
значение this из внешнего метода user.sayHi(): */

let user = {
    firstName: "Sasha",
    sayHi() {
        let arrow = () => console.log(this.firstName);
        arrow();
    },
};

user.sayHi(); // Sasha

/* Это особенность стрелочных функций. Она полезна, когда мы
на самом деле не хотим иметь отдельное this, а скорее хотим
взять его из внешнего контекста. */