/* Иногда нам нужна более сложная функция, с несколькими выражениями и инструкциями.
Это также возможно, нужно лишь заключить их в фигурные скобки. При этом важное
отличие - в том, что в таких скобках для возврата значения нужно использовать
return (как в обычных функциях). Вроде этого: */

let sum = (a,b) => { // фигурная скобка, открывающая тело многострочной функции
    let result = a + b;
    return result; // если мы используем фигурные скобки, то нам нужно явно указать "return"
};

console.log(sum(1,2)); // 3