/* Оператор "запятая" (,) редко применяется и является 
одним из самых необычных. Иногда он используется для написания
более короткого кода, поэтому нам нужно знать его, чтобы
понимать, что при этом происходит. Оператор "запятая" предоставляет
нам возможность вычислять несколько выражений, разделяя их
запятой ",". Каждое выражение выполняется, но возвращается результат
только последнего */

let a = (1 + 2, 3 + 4);
console.log(a); // 7 (результат вычисления 3 + 4)

// Запятая имеет очень низкий приоритет выполнения
// Даже ниже присваивания "="

/* Зачем нам оператор, который отбрасывает всё, 
кроме последнего выражения? Иногда оператор "запятая" используют
в составе более сложных конструкций, чтобы сделать 
несколько действий в одной строке. */

// Три операции в одной строке
for(a = 1, b = 3, c = a * b; a < 10; a++)
{

}