/* Приоритет оператора ?? такой же, как и у ||. Они оба равны 3 в таблице на MDN. Это
означает, что, как и ||, оператор нулевого слияния ?? вычисляется до = и ?, но после
большинства других операций, таких как +, *. */

let height = null;
let width = null;

// важно: используйте круглые скобки
let area = (height ?? 100) * (width ?? 50);
console.log(area);

/* Иначе, если опустить скобки, оператор * выполнится первым, т.к. у него
приоритет выше, чем у ??, и это приведёт к неправильным результатам */