/* По соображениям безопасности JavaScript запрещает использование оператора
?? вместе с && и ||, если приоритет явно не указан при помощи круглых скобок. */

let x = 1 && 2 ?? 3; // Синтаксическая ошибка

/* Это, безусловно, спорное ограничение было добавлено в спецификацию языка 
с целью избежать программные ошибки, когда люди начнут переходить с || на ??
Используйте скобки, чтобы обойти это ограничение. */

let y = (1 && 2) ?? 3; // Синтаксической ошибки нет, потому что есть скобки
console.log(y);