/* Функция всегда получает только копию значения: */

function showMessage(from,text) {
    from = '*' + from + '*'; // немного украсим "from"
    console.log(from + ': ' + text);
}

let from = "Аня";
showMessage(from, "Привет"); // *Аня*: Привет

// значение "from" осталось прежним, функция изменила значение локальной переменной
console.log(from);

/* Вывод: Мы объявляем функции со списком параметров, затем вызываем их,
передавая аргументы. Рассматривая приведённый выше пример, мы могли бы
сказать: "функция showMessage" объявляется с двумя параметрами, затем
вызывается с двумя аргументами: from и "Привет". */