let userName = "Вася";

function showMessage() {
    userName = "Петя"; // (1) изменяем значение внешней переменной
    
    let message = "Привет, " + userName;
    console.log(message);
}

console.log(userName); // Вася перед вызовом функции

showMessage(); 

console.log(userName); // Петя, значение внешней переменной было изменено функцией

/* Вывод: Функции можно использовать для разового изменения
значений внешних переменных. Например, мы соствили функцию,
которая выводит таблицу с паролями и затем меняет все пароли на
символ XXX, в общем, можно использовать функции для того,
чтобы менять значения внешних объектов и переменных. */