/* Внешняя переменная используется, только если внутри функции 
нет такой локальной. Если одноимённая переменная объявляется внутри
функции, тогда она перекрывает внешнюю. Например, в коде ниже 
функция использует локальную переменную userName.
Внешняя переменная будет проигнорирована: */

let userName = "Вася";

function showMessage() {
    let userName = "Петя"; // объявляем локальную переменную

    let message = "Привет, " + userName; // Петя
    console.log(message);
}

// Функция создаст и будет использовать свою собственную локальную переменную userName
showMessage();
console.log(userName); // Вася, не изменилось, функция не трогала внешнюю переменную

/* Вывод: если в нашей программе есть две одинаково названные
переменные и одна из этих переменных находится внутри 
функции, то функция будет использовать не внешнюю переменную,
которая находится вне функции, а внутреннюю переменную, которая
называется точно так же как внешняя. */