/* Параметры. Мы можем передать внутрь функции любую информацию,
используя параметры. В нижеприведённом примере функции 
передаются два параметра: from и text. */

function showMessage(from,text) {
    console.log(from + ": " + text);
}

/* В коде ниже происходит передача параметров функции */
showMessage("Аня", "Привет!"); // Аня: Привет! (*)
showMessage("Аня", "Как дела?"); // Аня: Как дела? (**)

/* Вывод: Когда функция вызывается в строках (*) и (**), переданные
значения копируются в локальные переменные from и text. Затем они
используются в теле функции. Вот ещё один пример: у нас есть переменная
from, и мы передаём её функции. Обратите внимание: функция
изменяет значение from, но это изменение не видно снаружи. 
Функция всегда получает только одну копию значения.*/