/* Обязателен ли "else"? Следующая функция возвращает true,
если параметр age больше 18. В ином случае она запрашивает
подтверждение через confirm и возвращает его результат: */

function checkAge(age) {
    if (age > 18) {
        return console.log("Доступ разрешён");
    } else {
        // ...
        return console.log("Родители разрешили?");
    }
}

checkAge(19);
checkAge(17);

/* Вывод: если убрать else, то это приведёт к тому, что
часть логики подпрограммы будет утрачена. Не смотря на то, 
что программа всё равно будет работать, логический диапазон 
будет значительно уже. */