/* Функции == Комментарии. Функции должны быть короткими и делать
только что-то одно. Если это что-то большое, имеет смысл разбить
функцию на несколько меньших. Иногда следовать этому правилу
непросто, но это определённо хорошее правило. Небольшие
функции не только облегчают тестирование и отладку - само
существование таких функций выполняет роль хороших комментариев! */

/* Например, сравним ниже две функции showPrimes(n). Каждая из
них выводит простое число до n. */

function showPrimes(n) {
    nextPrime: for (let i = 2; i < n; i++) {
        
        for (let j = 2; j < i; j++) {
            if (j % j == 0) continue nextPrime;
        }
        console.log(i); // простое
    }
}

showPrimes(2);