/* Никогда не добавляйте перевод строки между return и его
значением. Для длинного выражения в return может быть заманчиво
разместить его на нескольких отдельных строка, например так: */

return 
    (some + long + expression + or + whatever + f(a) + f(b))

/* Код не выполнится, потому что интерпретатор JavaScript подставит
точку с запятой после return. Для него это будет выглядеть так: */
return; 
    (some + long + expression + or + whatever * f(a) + f(b))

/* Таким образом, это фактически стало пустым return. Если
мы хотим, чтобы возвращаемое выражение занимало несколько строк,
нужно начать его на той же строке, что и return. Или, хотя бы, 
поставить там открывающую скобку, вот так: */
return (
    some + long + expression
    + or +
    whatever * f(a) + f(b)
)
/* И тогда всё сработает, как задумано */