/* Перепишите функцию, используя оператор "?" или "||".
Следующая функция возвращает true, если параметр age
больше 18. В ином случае она задаёт вопрос console.log() 
и возвращает его результат. */

function checkAge1(age) {
    return (age > 18) ? console.log("Доступ разрешён")
    : console.log("Родители разрешили?")
}

checkAge1(19);

function checkAge2(age) {
    return (age > 18) || console.log("Родители разрешили?");
}
// Круглые скобки вокруг age > 18 не обязательны.
// Они здесь для лучшей читаемости кода

checkAge2(19);
/* Вывод: в некоторых ситуациях более лаконичным и кратким
вариантом будет использование оператора "?" вместо очень громоздкого 
"if" */