/* Выбор имени функции. Функция - это действие. Жизнь - это движение.
=> Функция - это жизнь. Жизнь - это движение. => Функция - это движение. 
Поэтому имя функции обычно является глаголом.
Оно должно быть кратким, точным и описывать действие функции,
чтобы программист, который будет читать код, получил верное
представление о том, что делает функция. Как правило, 
используются глагольные префиксы, обозначающие общий
характер действия, после которых следует уточнение. Обычно
в командах разработчиков действуют соглашения, касающиеся
значений этих префиксов. Например, функции, начинающиеся со
слова "show" обычно что-то показывают. */

/* Функции, начинающиеся с...
1. "get..." - возвращают значение,
2. "calc..." - что-то вычисляют,
3. "create..." - что-то создают,
4. "check..." - что-то проверяют и возвращают логическое значение, и т.д.
Примеры таких имён:
*/

showMessage(); // показывает сообщение
getAge(); // возвращает возраст (получая его каким-то образом)
calcSum(); // вычисляет сумму и возвращает результаты
createForM(); // создаёт форму (и обычно возвращает её)
checkPermission(); // проверяет доступ, возвращая true/false
