/* Директива return может находиться в любом месте тела функции.
Как только выполнение доходит до этого места, функция останавливается,
и значение возвращается в вызвавший её код (присваивается переменной result выше).
Вызов return может быть несколько, например: */

function checkAge(age) {
    if (age >= 18) {
        return true;
    } else {
        return console.log("А родители разрешили?");
    }
}

let age = 18;

if (checkAge(age)) {
    console.log("Доступ получен");
} else {
    console.log("Доступ закрыт");
}