/* ИЛИ "||" находит первое истинное значение, проще описать это
так: если хотя бы одно из перечисленных условий является
истинным, то логическое "ИЛИ" возвращает true,
Нужно ли описывать то, что произойдёт, если не произойдёт
ни одно из условий логического "ИЛИ", вопрос конечно практичный.
Я считаю, что нужно описывать всю логику целиком для понимания
всей картины. */

console.log(1 || 0); // 1
console.log(true || 'no matter what'); // true
console.log(null || 1); // 1 (первое истинное значение)
console.log(null || 0 || 1); // 1 (первое истинное значение)
console.log(undefined || null || 0); // 0 (поскольку всё ложно, возвращается последнее значение)
