/* Операндами могут быть как отдельные значения, так и произвольные
выражения. ИЛИ || вычисляет их слева направо. Вычисление останавливается при 
достижении первого истинного значения. Этот процесс называется
"сокращённым вычислением", поскольку второй операнд вычисляется только
в том случае, если первого недостаточно для вычисления всего выражения */

let x;
true || (x = 1);
console.log(x); 
// undefined, потому что (x = 1) не вычисляется

let y;
false || (y = 1);
console.log(y);
// Вариант использование || является "аналогом if"