/* !(НЕ). Оператор "НЕ" представлен восклицательным знаком "!". 
Оператор сначала принимает один аргумент и выполняет следующие 
действия: 
1. Сначала приводит аргумент к логическому типу true/false.
2. Затем возвращает противоположное значение */
console.log(!true); // false
console.log(!0); // true

/* В частности, двойное "НЕ" "!!" используют для
преобразования значений к логическому типу */
console.log(!!"non-empty string"); // true
console.log(!!null); // false

/* Есть немного более подробный способ сделать то же самое 
- встроенная функция Boolean: */
console.log(Boolean("non-empty string")); // true
console.log(Boolean(null)); // false