/* Кроме этого, можно записать последовательность из операторов ??,
чтобы получить первое значение из списка, которое не является null/undefined. 
Допустим, у нас есть данные пользователя в переменных firstName, lastName или
nickName. Все они могут не существовать, если пользователь решил не вводить соответствующее
значение. */
let firstName = null;
let lastName = null;
let nickName = "Суперкодер";

// показывает первое значение, которое определено
console.log(firstName ?? lastName ?? nickName ?? "Аноним"); // Суперкодер