/* Оператор нулевого слияния обрабатывает null и undefined одинаковым
образом. Для краткости будем говорить, что значение "определено", если
оно не равняется ни null, ни undefined. */

/* Иначе говоря, оператор ?? возвращает первый аргумент, если он не
null/undefined, иначе возвращает второй аргумент. Оператор
нулевого слияния не является чем-то принципиально новым. Это всего лишь
удобный синтаксис, как из двух значений получить одно, которое "определено". */
a = true; b = true;
result = (a !== null && a !== undefined) ? a : b;
console.log(result);


