/* Сравнение строк. Чтобы определить, что одна строка больше другой,
JavaScript использует "алфавитный" или "лексикографический" порядок */

console.log('Я' > 'A'); // true
console.log('Коты' > 'Кода'); // true
console.log('Сонный' > 'Сон'); // true

/*
Алгоритм сравнения двух строк довольно прост:
1. Сначала сравниваются первые символы строк.
2. Если первый символ первой строки больше (меньше),
чем первый символ второй строки, то первая строка больше
(меньше) второй. Сравнение завершено.
3. Если первые символы равны, то таким же образом сравниваются уже
вторые символы строк.
4. Сравнение продолжается, пока не закончится одна из строк.
5. Если обе строки заканчиваются одновременно, то они равны. Иначе,
большей считается более длинная строка. 
*/

/* 
В примерах выше сравнение "Я" > "A" завершится на первом шаге,
тогда как строки "Коты" и "Кода" будут сравниваться посимвольно:
1. K равна K.
2. o равна o.
3. т больше, чем д. На этом сравнение заканчивается. Первая строка больше.
*/

console.log(" 'A' < 'a' ? ", "A" < "a")

/* Строчная 'a' больше чем заглавная 'A' потому что
строчные буквы имеют больший код во внутренней таблице кодирования,
которую использует JavaScript, эта таблица кодирования называется
Unicode */