/* Группировка "case". Несколько вариантов case, использующих 
один код, можно группировать. Для примера, выполним один и тот
же код для case 3 и case 5, сгруппировав их: */

let a = 3;

switch (a) {
    case 4: 
      console.log("Правильно!");
      break;
    case 3: // (*) группируем оба case
    case 5: 
      console.log("Неправильно!");
      console.log("Может вам посетить урок математики?");
      break;
    default: 
      console.log("Результат выглядит странновато. Честно.");
}
/* Вывод: возможность группировать case - это побочный эффект того, 
как switch/case работает без break. Здесь выполнение case 3 начинается со
строки (*) и продолжается в case 5, потому что отсутствует break.  */