/* Вопрос об "if". Какие из перечисленных console.log() 
выполнятся? Какие конкретно значения будут результатами выражений в условиях if(...)?
*/

// Выполнится
// Результат -1 || 0 = -1, в логическом контексте true
if (-1 || 0) console.log("first"); 
// Не выполнится
// -1 && 0 = 0, в логическом контексте false
if (-1 && 0) console.log("second"); 
// Выполнится
// Оператор && имеет больший приоритет, чем ||
// так что -1 && 1 выполнится раньше
// Вычисления: null || -1 && 1 -> null || 1 -> 1
if (null || -1 && 1) console.log("third"); 


/* Ответ: первое и третье выполнятся. */