/* Отступы. Существует два типа отступов: 1) Горизонтальные отступы: 2 или 4 пробела.
Горизонтальный отступ выполняется с помощью 2 или 4 пробелов, или символа табуляции
(клавиша Tab). Какой из них выбрать - это уже на ваше усмотрение. Пробелы
больше распространены. Одно из преимуществ пробелов над табуляцией заключается в том, что
пробелы допускают более гибкие конфигурации отступов, чем символ табуляции. Например,
мы можем выровнять аргументы относительно открывающей скобки: */

console.log(
            "string",
            "string",
            "string",
            "string"
           )
