/* Точка с запятой. Точка с запятой должны присутствовать после
каждого выражения, даже если их, казалось бы, можно пропустить.
Есть языки, в которых точка с запятой необязательна и редко используется.
Однако в JavaScript бывают случаи, когда перенос строки не интерпретируется,
как точка с запятой, что может привести к ошибкам. Если вы -
- опытный разработчик на JavaScript, то можно выбрать стиль кода без
точек с запятой, например StandardJS. В ином случае, лучше будет 
использовать точки с запятой, чтобы избежать подводных камней. 
Большинство разработчиков их ставят. */