/* Способы записи числа */

let billion = 1000000000;
console.log(billion); // 1000000000

let billion1 = 1e9; // 1 миллиард, буквально 1 и 9 нулей
console.log(billion1); // 1000000000

// 1e3 = 1 * 1000
// 1.23e6 = 1.23 * 1000000

let ms = 0.000001;
console.log(ms); // 0.000001

let ms1 = 1e-6; // шесть нулей, слева от 1
console.log(ms1); // 0.000001

// 1 делится на 1 с 3 нулями
// 1e-3 = 1 / 1000 (=0.001)

// 1.23 делится на 1 и 6 нулями
// 1.23e-6 = 1.23 / 1000000 (=0.00000123)

console.log(0xff); // 255
console.log(0xFF); // 255

let a = 0b11111111; // бинарная форма записи числа 255
let b = 0o377; // восьмеричная форма записи числа 255

console.log(a == b); // true, с двух сторон число 255